# Indian E-Commerce Data

This project utilizes a basic dataset from an anonymous e-commerce company located in India. Three csv files are combined into a three table database file using DB Browser for SQLite. SQL queries are run in Jupyter via ipython-sql and query results are saved as variables for further analysis and visualization.

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sb
import sqlite3 as sql

## Data Cleaning

Before I create the database file that I'll use in this project, I need do some cleaning operations. Two of the csv files included in the dataset contain date information that is not in the correct format for use in SQLite queries. I need to change the date formats so that I can utilize SQLite's strftime function. The date formats need to look like this: YYYY-MM-DD

In [35]:
df = pd.read_csv('List of Orders.csv')

In [36]:
df.head()

  Order ID  Order Date CustomerName           State       City
0  B-25601  01-04-2018       Bharat         Gujarat  Ahmedabad
1  B-25602  01-04-2018        Pearl     Maharashtra       Pune
2  B-25603  03-04-2018        Jahan  Madhya Pradesh     Bhopal
3  B-25604  03-04-2018       Divsha       Rajasthan     Jaipur
4  B-25605  05-04-2018      Kasheen     West Bengal    Kolkata

In [37]:
df['Order Date'] = df['Order Date'].str[-4:] + "-" + df['Order Date'].str[3:5] + "-" + df['Order Date'].str[:2]

In [38]:
df.head()

  Order ID  Order Date CustomerName           State       City
0  B-25601  2018-04-01       Bharat         Gujarat  Ahmedabad
1  B-25602  2018-04-01        Pearl     Maharashtra       Pune
2  B-25603  2018-04-03        Jahan  Madhya Pradesh     Bhopal
3  B-25604  2018-04-03       Divsha       Rajasthan     Jaipur
4  B-25605  2018-04-05      Kasheen     West Bengal    Kolkata

In [40]:
df.to_csv('list_of_orders_clean.csv', index = False)

In [32]:
targets = pd.read_csv('Sales target.csv')

In [33]:
targets.head()

  Month of Order Date   Category   Target
0              Apr-18  Furniture  10400.0
1              May-18  Furniture  10500.0
2              Jun-18  Furniture  10600.0
3              Jul-18  Furniture  10800.0
4              Aug-18  Furniture  10900.0

In [11]:
months = {'Jan':'01',
         'Feb':'02',
         'Mar':'03',
         'Apr':'04',
         'May':'05',
         'Jun':'06',
         'Jul':'07',
         'Aug':'08',
         'Sep':'09',
         'Oct':'10',
         'Nov':'11',
         'Dec':'12'}

In [12]:
targets['Month of Order Date'] = targets['Month of Order Date'].replace(months, regex=True)

In [13]:
targets['Month of Order Date'] = "20" + targets['Month of Order Date'].str[-2:] + "-" + targets['Month of Order Date'].str[:3] + "01"

In [27]:
targets.head()

  Month of Order Date   Category   Target
0          2018-04-01  Furniture  10400.0
1          2018-05-01  Furniture  10500.0
2          2018-06-01  Furniture  10600.0
3          2018-07-01  Furniture  10800.0
4          2018-08-01  Furniture  10900.0

In [15]:
targets.to_csv('sales_target_clean.csv', index=False)

## Create Database and Connect to Database File

Now that I have the date formats ready for SQLite, the csv files are combined into a database file externally using DB Browser for SQLite, and I can load SQL into the notebook and connect to the database file I've created

In [2]:
%load_ext sql

In [3]:
%sql sqlite:////users/john/desktop/indian_ecommerce_data/list_of_orders.db

In [41]:
%%sql

SELECT *
FROM orders
LIMIT 5;

 * sqlite:////users/john/desktop/indian_ecommerce_data/list_of_orders.db
Done.

[('B-25601', '2018-04-01', 'Bharat', 'Gujarat', 'Ahmedabad'),
 ('B-25602', '2018-04-01', 'Pearl', 'Maharashtra', 'Pune'),
 ('B-25603', '2018-04-03', 'Jahan', 'Madhya Pradesh', 'Bhopal'),
 ('B-25604', '2018-04-03', 'Divsha', 'Rajasthan', 'Jaipur'),
 ('B-25605', '2018-04-05', 'Kasheen', 'West Bengal', 'Kolkata')]

In [29]:
%%sql

SELECT *
FROM details
LIMIT 5;

 * sqlite:////users/john/desktop/indian_ecommerce_data/list_of_orders.db
Done.

[('B-25601', 1275.0, -1148.0, 7, 'Furniture', 'Bookcases'),
 ('B-25601', 66.0, -12.0, 5, 'Clothing', 'Stole'),
 ('B-25601', 8.0, -2.0, 3, 'Clothing', 'Hankerchief'),
 ('B-25601', 80.0, -56.0, 4, 'Electronics', 'Electronic Games'),
 ('B-25602', 168.0, -111.0, 2, 'Electronics', 'Phones')]

In [28]:
%%sql

SELECT *
FROM targets
LIMIT 5;

 * sqlite:////users/john/desktop/indian_ecommerce_data/list_of_orders.db
Done.

[('2018-04-01', 'Furniture', 10400.0),
 ('2018-05-01', 'Furniture', 10500.0),
 ('2018-06-01', 'Furniture', 10600.0),
 ('2018-07-01', 'Furniture', 10800.0),
 ('2018-08-01', 'Furniture', 10900.0)]